src/InformationRegisters/ТекущиеЛокацииКампаний/ТекущиеЛокацииКампаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеЛокацииКампаний</name>
  <resources>
    <name>Локация</name>
    <type>
      <types>CatalogRef.Локации</types>
    </type>
  </resources>
  <dimensions>
    <name>Кампания</name>
    <type>
      <types>CatalogRef.Кампании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ТекущаяЛокация/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает текущую локацию активной кампании из регистра сведений
// «ТекущиеЛокацииКампаний».
//
// Возвращаемое значение:
//   СправочникСсылка.Локации - текущая локация активной кампании
//   - Неопределено - если активная кампания не задана либо запись в регистре отсутствует
Функция Получить() Экспорт

	АктивнаяКампания = ПараметрыСеанса.АктивнаяКампания;

	Если Не ЗначениеЗаполнено(АктивнаяКампания) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запись = РегистрыСведений.ТекущиеЛокацииКампаний.Получить(
		Новый Структура("Кампания", АктивнаяКампания));

	Если Запись = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Запись.Локация;

КонецФункции

// Записывает переданную локацию как текущую для активной кампании в регистр сведений
// «ТекущиеЛокацииКампаний». Перед записью проверяет заполненность активной кампании
// и локации, отсутствие пометки удаления у локации и совпадение её владельца
// с активной кампанией; при непрохождении проверки выводит сообщение пользователю
// и завершается без записи.
//
// Параметры:
//   Локация - СправочникСсылка.Локации - локация, устанавливаемая текущей
//             для активной кампании
Процедура Установить(Локация) Экспорт

	АктивнаяКампания = ПараметрыСеанса.АктивнаяКампания;

	Если Не ЗначениеЗаполнено(АктивнаяКампания) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не установлена активная кампания.'"));
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Локация) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указана локация.'"));
		Возврат;
	КонецЕсли;

	РеквизитыЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Локация, "ПометкаУдаления, Владелец");

	Если РеквизитыЛокации.ПометкаУдаления Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Локация помечена на удаление.'"));
		Возврат;
	КонецЕсли;

	Если РеквизитыЛокации.Владелец <> АктивнаяКампания Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Локация не принадлежит активной кампании.'"));
		Возврат;
	КонецЕсли;

	Запись = РегистрыСведений.ТекущиеЛокацииКампаний.СоздатьМенеджерЗаписи();
	Запись.Кампания = АктивнаяКампания;
	Запись.Локация = Локация;
	Запись.Записать();

КонецПроцедуры

// Удаляет запись текущей локации активной кампании из регистра сведений
// «ТекущиеЛокацииКампаний». Если активная кампания не задана, действий не выполняет.
Процедура Очистить() Экспорт

	АктивнаяКампания = ПараметрыСеанса.АктивнаяКампания;

	Если Не ЗначениеЗаполнено(АктивнаяКампания) Тогда
		Возврат;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.ТекущиеЛокацииКампаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Кампания.Установить(АктивнаяКампания);
	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти
